# Open tap containing more recent versions of system tools
tap "homebrew/dupes"

# Update essentials
brew "git"
brew "vim"
brew "zsh"

# Essentials
brew "wget"

# JS
brew "node"

# C/C++
brew "cmake"
brew "gdb"
brew "cgdb"
brew "valgrind"

# Python
brew "python"
brew "python3"

# Misc
brew "archey"
brew "astyle"
brew "tree"
brew "wget"

